Revit 2026 API

# FailuresAccessorJournalFailures Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void JournalFailures(
	IList<FailureMessageAccessor> failures
)
```
```vb
Public Sub JournalFailures (
	failures As IList(Of FailureMessageAccessor)
)
```
```cpp
public:
void JournalFailures(
	IList<FailureMessageAccessor^>^ failures
)
```
```fsharp
member JournalFailures :
        failures : IList<FailureMessageAccessor> -> unit
```

#### Parameters

failures IListFailureMessageAccessor

#### Reference

FailuresAccessor Class

Autodesk.Revit.DB Namespace